app/controllers/mr_car_parts_controller.rb

SELECT "mr_car_parts".* FROM "mr_car_parts"
---
  def index
    @mr_car_parts = MrCarPart.all

INSERT INTO "mr_car_parts" ("Make", "Model", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Make", "Ford"], ["Model", "Explorer"], ["price", 40.0], ["created_at", "2019-09-12 03:23:16.769167"], ["updated_at", "2019-09-12 03:23:16.769167"]]
---
  def create
    @mr_car_part = MrCarPart.new(mr_car_part_params)

    respond_to do |format|
      if @mr_car_part.save

UPDATE "mr_car_parts" SET "price" = ?, "updated_at" = ? WHERE "mr_car_parts"."id" = ?  [["price", 20.0], ["updated_at", "2019-09-12 04:51:59.564513"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @mr_car_part.update(mr_car_part_params)

DELETE FROM "mr_car_parts" WHERE "mr_car_parts"."id" = ?  [["id", 3]]
---
  def destroy
    @mr_car_part.destroy

SELECT  "mr_car_parts".* FROM "mr_car_parts" WHERE "mr_car_parts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_mr_car_part
      @mr_car_part = MrCarPart.find(params[:id])